# Command to backup and reinstall pacman packages
# The list includes stuff installed from pacman as well as AUR
# Remove these comments before running the commands
# Backup:   pacman -Qqe | grep -v "$(pacman -Qqm)" > pacman.lst
# Restore:   cat pacman.lst | xargs pacman -S --needed --noconfirm


acpi
alacritty
alsa-utils
asoundconf
autoconf
automake
base
binutils
bison
cronie
dbeaver
docker
dosfstools
dunst
efibootmgr
fakeroot
feh
flex
gcc
git
gnome-keyring
groff
grub
gtk2
htop
jq
kitty
libguestfs
libtool
libvirt
linux
linux-firmware
linux-headers
m4
maim
make
mtools
networkmanager
ntfs-3g
ntp
nvidia
nvidia-settings
nvidia-utils
openssh
os-prober
patch
pavucontrol
peek
piper
pkgconf
playerctl
pulseaudio
redis
rofi
rust
seahorse
sudo
texinfo
transmission-gtk
ttf-croscore
ttf-fira-code
ttf-indic-otf
unarchiver
unzip
vim
vlc
wget
which
wmctrl
xclip
xf86-video-vesa
xkeycaps
xmonad
xmonad-contrib
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
zsh
zsh-autosuggestions
zsh-syntax-highlighting
